yuplus/nxp-mcx-series/MCXE247/periph0/PERI_FTFC.h
#define FTFC_FSTAT_RDCOLERR_MASK                 (0x40U)
#define FTFC_FSTAT_RDCOLERR_SHIFT                (6U)
/*! RDCOLERR - FTFC Read Collision Error Flag
 *  0b0..No collision error detected
 *  0b1..Collision error detected
 */
#define FTFC_FSTAT_RDCOLERR(x)                   (((uint8_t)(((uint8_t)(x)) << FTFC_FSTAT_RDCOLERR_SHIFT)) & FTFC_FSTAT_RDCOLERR_MASK)

#define FTFC_FSTAT_CCIF_MASK                     (0x80U)
#define FTFC_FSTAT_CCIF_SHIFT                    (7U)
/*! CCIF - Command Complete Interrupt Flag
 *  0b0..FTFC command or emulated EEPROM file system operation in progress
 *  0b1..FTFC command or emulated EEPROM file system operation has completed
 */
#define FTFC_FSTAT_CCIF(x)                       (((uint8_t)(((uint8_t)(x)) << FTFC_FSTAT_CCIF_SHIFT)) & FTFC_FSTAT_CCIF_MASK)
/*! @} */

/*! @name FCNFG - Flash Configuration Register */
/*! @{ */

#define FTFC_FCNFG_EEERDY_MASK                   (0x1U)
#define FTFC_FCNFG_EEERDY_SHIFT                  (0U)
/*! EEERDY - EEERDY
 *  0b0..FlexRAM is not available for emulated EEPROM operation
 *  0b1..FlexRAM is available for EEPROM operations where: (1) reads from the FlexRAM return data previously
 *       written to the FlexRAM in emulated EEPROM mode and (2) writes launch an EEPROM operation to store the written
 *       data in the FlexRAM and EEPROM backup.
 */
#define FTFC_FCNFG_EEERDY(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_EEERDY_SHIFT)) & FTFC_FCNFG_EEERDY_MASK)

#define FTFC_FCNFG_RAMRDY_MASK                   (0x2U)
#define FTFC_FCNFG_RAMRDY_SHIFT                  (1U)
/*! RAMRDY - RAM Ready
 *  0b0..FlexRAM is not available for traditional RAM access
 *  0b1..FlexRAM is available as traditional RAM only; writes to the FlexRAM do not trigger EEPROM operations
 */
#define FTFC_FCNFG_RAMRDY(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_RAMRDY_SHIFT)) & FTFC_FCNFG_RAMRDY_MASK)

#define FTFC_FCNFG_ERSSUSP_MASK                  (0x10U)
#define FTFC_FCNFG_ERSSUSP_SHIFT                 (4U)
/*! ERSSUSP - Erase Suspend
 *  0b0..No suspend requested
 *  0b1..Suspend the current Erase Flash Sector command execution
 */
#define FTFC_FCNFG_ERSSUSP(x)                    (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_ERSSUSP_SHIFT)) & FTFC_FCNFG_ERSSUSP_MASK)

#define FTFC_FCNFG_ERSAREQ_MASK                  (0x20U)
#define FTFC_FCNFG_ERSAREQ_SHIFT                 (5U)
/*! ERSAREQ - Erase All Request
 *  0b0..No request or request complete
 *  0b1..Request to: (1) run the Erase All Blocks command, (2) verify the erased state, (3) program the security
 *       byte in the Flash Configuration Field to the unsecure state, and (4) release MCU security by setting the
 *       FSEC[SEC] field to the unsecure state.
 */
#define FTFC_FCNFG_ERSAREQ(x)                    (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_ERSAREQ_SHIFT)) & FTFC_FCNFG_ERSAREQ_MASK)

#define FTFC_FCNFG_RDCOLLIE_MASK                 (0x40U)
#define FTFC_FCNFG_RDCOLLIE_SHIFT                (6U)
/*! RDCOLLIE - Read Collision Error Interrupt Enable
 *  0b0..Read collision error interrupt disabled
 *  0b1..Read collision error interrupt enabled. An interrupt request is generated whenever an FTFC read collision
 *       error is detected (see the description of FSTAT[RDCOLERR]).
 */
#define FTFC_FCNFG_RDCOLLIE(x)                   (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_RDCOLLIE_SHIFT)) & FTFC_FCNFG_RDCOLLIE_MASK)

#define FTFC_FCNFG_CCIE_MASK                     (0x80U)
#define FTFC_FCNFG_CCIE_SHIFT                    (7U)
/*! CCIE - Command Complete Interrupt Enable
 *  0b0..Command complete interrupt disabled
 *  0b1..Command complete interrupt enabled. An interrupt request is generated whenever the FSTAT[CCIF] flag is set.
 */
#define FTFC_FCNFG_CCIE(x)                       (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_CCIE_SHIFT)) & FTFC_FCNFG_CCIE_MASK)
/*! @} */

/*! @name FSEC - Flash Security Register */
/*! @{ */

#define FTFC_FSEC_SEC_MASK                       (0x3U)
#define FTFC_FSEC_SEC_SHIFT                      (0U)
/*! SEC - Flash Security
 *  0b00..MCU security status is secure
 *  0b01..MCU security status is secure
 *  0b10..MCU security status is unsecure (The standard shipping condition of the FTFC is unsecure.)
 *  0b11..MCU security status is secure
 */
#define FTFC_FSEC_SEC(x)                         (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_SEC_SHIFT)) & FTFC_FSEC_SEC_MASK)

#define FTFC_FSEC_FSLACC_MASK                    (0xCU)
#define FTFC_FSEC_FSLACC_SHIFT                   (2U)
/*! FSLACC - Factory Failure Analysis Access Code
 *  0b00..Factory access granted
 *  0b01..Factory access denied
 *  0b10..Factory access denied
 *  0b11..Factory access granted
 */
#define FTFC_FSEC_FSLACC(x)                      (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_FSLACC_SHIFT)) & FTFC_FSEC_FSLACC_MASK)

#define FTFC_FSEC_MEEN_MASK                      (0x30U)
#define FTFC_FSEC_MEEN_SHIFT                     (4U)
/*! MEEN - Mass Erase Enable Bits
 *  0b00..Mass erase is enabled
 *  0b01..Mass erase is enabled
 *  0b10..Mass erase is disabled
 *  0b11..Mass erase is enabled
 */
#define FTFC_FSEC_MEEN(x)                        (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_MEEN_SHIFT)) & FTFC_FSEC_MEEN_MASK)

#define FTFC_FSEC_KEYEN_MASK                     (0xC0U)
#define FTFC_FSEC_KEYEN_SHIFT                    (6U)
/*! KEYEN - Backdoor Key Security Enable
 *  0b00..Backdoor key access disabled
 *  0b01..Backdoor key access disabled (preferred KEYEN state to disable backdoor key access)
 *  0b10..Backdoor key access enabled
 *  0b11..Backdoor key access disabled
 */
#define FTFC_FSEC_KEYEN(x)                       (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_KEYEN_SHIFT)) & FTFC_FSEC_KEYEN_MASK)
/*! @} */

/*! @name FOPT - Flash Option Register */
/*! @{ */

#define FTFC_FOPT_OPT_MASK                       (0xFFU)
#define FTFC_FOPT_OPT_SHIFT                      (0U)
/*! OPT - Nonvolatile Option */
#define FTFC_FOPT_OPT(x)                         (((uint8_t)(((uint8_t)(x)) << FTFC_FOPT_OPT_SHIFT)) & FTFC_FOPT_OPT_MASK)
/*! @} */

/*! @name FCCOB3 - Flash Common Command Object Registers */
/*! @{ */

