yuplus/nxp-mcx-series/MCXE247/periph0/PERI_FTFC.h
#define FTFC_FCCOB3_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB3_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB3_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB3_CCOBn_SHIFT)) & FTFC_FCCOB3_CCOBn_MASK)
/*! @} */

/*! @name FCCOB2 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB2_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB2_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB2_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB2_CCOBn_SHIFT)) & FTFC_FCCOB2_CCOBn_MASK)
/*! @} */

/*! @name FCCOB1 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB1_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB1_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB1_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB1_CCOBn_SHIFT)) & FTFC_FCCOB1_CCOBn_MASK)
/*! @} */

/*! @name FCCOB0 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB0_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB0_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB0_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB0_CCOBn_SHIFT)) & FTFC_FCCOB0_CCOBn_MASK)
/*! @} */

/*! @name FCCOB7 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB7_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB7_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB7_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB7_CCOBn_SHIFT)) & FTFC_FCCOB7_CCOBn_MASK)
/*! @} */

/*! @name FCCOB6 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB6_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB6_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB6_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB6_CCOBn_SHIFT)) & FTFC_FCCOB6_CCOBn_MASK)
/*! @} */

/*! @name FCCOB5 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB5_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB5_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB5_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB5_CCOBn_SHIFT)) & FTFC_FCCOB5_CCOBn_MASK)
/*! @} */

/*! @name FCCOB4 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB4_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB4_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB4_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB4_CCOBn_SHIFT)) & FTFC_FCCOB4_CCOBn_MASK)
/*! @} */

/*! @name FCCOBB - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOBB_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOBB_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOBB_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOBB_CCOBn_SHIFT)) & FTFC_FCCOBB_CCOBn_MASK)
/*! @} */

/*! @name FCCOBA - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOBA_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOBA_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOBA_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOBA_CCOBn_SHIFT)) & FTFC_FCCOBA_CCOBn_MASK)
/*! @} */

/*! @name FCCOB9 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB9_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB9_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB9_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB9_CCOBn_SHIFT)) & FTFC_FCCOB9_CCOBn_MASK)
/*! @} */

/*! @name FCCOB8 - Flash Common Command Object Registers */
/*! @{ */

#define FTFC_FCCOB8_CCOBn_MASK                   (0xFFU)
#define FTFC_FCCOB8_CCOBn_SHIFT                  (0U)
/*! CCOBn - CCOBn */
#define FTFC_FCCOB8_CCOBn(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB8_CCOBn_SHIFT)) & FTFC_FCCOB8_CCOBn_MASK)
/*! @} */

/*! @name FPROT3 - Program Flash Protection Registers */
/*! @{ */

#define FTFC_FPROT3_PROT_MASK                    (0xFFU)
#define FTFC_FPROT3_PROT_SHIFT                   (0U)
/*! PROT - Program Flash Region Protect */
#define FTFC_FPROT3_PROT(x)                      (((uint8_t)(((uint8_t)(x)) << FTFC_FPROT3_PROT_SHIFT)) & FTFC_FPROT3_PROT_MASK)
/*! @} */

/*! @name FPROT2 - Program Flash Protection Registers */
/*! @{ */

#define FTFC_FPROT2_PROT_MASK                    (0xFFU)
#define FTFC_FPROT2_PROT_SHIFT                   (0U)
/*! PROT - Program Flash Region Protect */
#define FTFC_FPROT2_PROT(x)                      (((uint8_t)(((uint8_t)(x)) << FTFC_FPROT2_PROT_SHIFT)) & FTFC_FPROT2_PROT_MASK)
/*! @} */

/*! @name FPROT1 - Program Flash Protection Registers */
/*! @{ */

#define FTFC_FPROT1_PROT_MASK                    (0xFFU)
#define FTFC_FPROT1_PROT_SHIFT                   (0U)
/*! PROT - Program Flash Region Protect */
#define FTFC_FPROT1_PROT(x)                      (((uint8_t)(((uint8_t)(x)) << FTFC_FPROT1_PROT_SHIFT)) & FTFC_FPROT1_PROT_MASK)
/*! @} */

/*! @name FPROT0 - Program Flash Protection Registers */
/*! @{ */

#define FTFC_FPROT0_PROT_MASK                    (0xFFU)
#define FTFC_FPROT0_PROT_SHIFT                   (0U)
/*! PROT - Program Flash Region Protect */
#define FTFC_FPROT0_PROT(x)                      (((uint8_t)(((uint8_t)(x)) << FTFC_FPROT0_PROT_SHIFT)) & FTFC_FPROT0_PROT_MASK)
/*! @} */

/*! @name FEPROT - EEPROM Protection Register */
/*! @{ */

#define FTFC_FEPROT_EPROT_MASK                   (0xFFU)
#define FTFC_FEPROT_EPROT_SHIFT                  (0U)
/*! EPROT - EEPROM Region Protect
 *  0b00000000..EEPROM region is protected
 *  0b00000001..EEPROM region is not protected
 */
#define FTFC_FEPROT_EPROT(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FEPROT_EPROT_SHIFT)) & FTFC_FEPROT_EPROT_MASK)
/*! @} */

/*! @name FDPROT - Data Flash Protection Register */
/*! @{ */

#define FTFC_FDPROT_DPROT_MASK                   (0xFFU)
#define FTFC_FDPROT_DPROT_SHIFT                  (0U)
/*! DPROT - Data Flash Region Protect
 *  0b00000000..Data Flash region is protected
 *  0b00000001..Data Flash region is not protected
 */
#define FTFC_FDPROT_DPROT(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FDPROT_DPROT_SHIFT)) & FTFC_FDPROT_DPROT_MASK)
/*! @} */

